[
  {
    "index": 1,
    "title": "1. Introduction to Accounting and Financial Statements",
    "content": "Introduction to Accounting& Financial Statements MN 3043 - Business Economics and FinancialAccounting Faculty of Engineering University of Moratuwa Conducted by Ms Mahimi Kanchana Learning Outcomes At the end of this lesson you should be able to, -Identify the meaning of Accounting & Financial Statements - Analyze the accounting process - Describe the Double Entry System - Analyze the core concepts of accounting - Record the transactions to calculate the results • Why engineers require to learn accounting? Objective and Need Importanceof Accounting • To know whether the business has earned an adequate profit • To know whether the financial position of the business is sound • To fulfill legal requirements (presentation of financial reports is a mandatory requirement by law for some organizations) • To minimize disadvantages arising through omission and commission of transactions, and to organize financial activities Main stages ofAccounting • Book keeping - merely concerned with orderly record keeping. • Accounting - has broader scope involves in analysis and judgment at different stages (recording of transactions, classification, summarization and interpretation) Book-keeping “Book-keeping is the science and art of correctly recording in the books of account all those business transactions that result in the transfer of money or money's worth.” -R.N. Carter- Objectives ; •To have permanent record of all the business transactions. •To keep records of income and expenses in such a way that the net profit or net loss may be calculated. •To keep records of assets and liabilities in such a way that the financial position of the business may be ascertained. Definition ofAccounting “The art of recording, classification and summarizing in a significant manner and in terms of money transactions and events which are, in part at least, of a financial character, and interpreting the results thereof. -The American Institute of Certified Public Accountants- Definition of AccountingContd. “The process of identifying, measuring and communicating economic information permit informed judgments and decision by users of the information”. - American Accounting Association- Objectives ofAccounting • To maintain accounting records • To calculate the result of operations • To ascertain the financial position • To communicate the information to users • To fulfill the statutory requirements • To attract the shareholders • For management decision making Users of AccountingInformation • Internal users Internal users Purpose Owners To know the profitability and financial soundness of the business Management To take prompt decisions to manage the business efficiently Employees and Trade unions To form judgment about the earning capacity of the business since their remuneration and bonus depend on it. • External Users External users Purpose Creditors, banks and other To determine whether the principal and lending institutions the interest thereof will be paid in when due Present investors To know the position, progress and prosperity of the business in order to ensure the safety of their investment Potential investors To decide whether to invest in the business or not Government and Tax To know the earnings in order to assess authorities the tax liabilities of the business Regulatory agencies To evaluate the business operation under the regulatory legislation Branches ofAccounting Branches ofAccounting Financial Accounting •It is concerned with recording of business transactions in the books of accounts in such a way that operating result of a particular period and financial position on a particular date can be known. Cost Accounting •It relates to collection, classification and ascertainment of the cost of production or job undertaken by the firm. Management Accounting •It relates to the use of accounting data collected with the help of financial accounting and cost accounting for the purpose of policy formulation, planning, control and decision making by the management. Generally Accepted AccountingPrinciples, Conventions andConcepts • Business Entity Concept • Money Measurement Concept • Historical Cost Concept • Periodic Concept • Realization Concept • Matching Concept • Materiality Concept • Going Concern Concept • Consistency Concept • Accrual Concept • Realization Concept • Prudence concept Generally Accepted AccountingPrinciples, Conventions andConcepts Business Entity Concept ➢Business entity concept requires that the business should be treated as a distinct accounting entity for the purpose treating transactions relating the operations. ➢This is one of the most important and fundamental accounting principle with which Double Entry system of accounting has evolved. ➢Accounts need to be maintained separate from the owners and provisions providers of capital. Generally Accepted AccountingPrinciples, Conventions andConcepts Money Measurement Concept Recording, classification and summarizing of business transactions require a common unit of measurement. Record should be made only of that information which can be expressed in Monetary Term that is currency value(USD,Rs & etc.) Examples:- • Sole proprietor had 40 tables and chairs. This can't be recorded unless a value of furniture is known in monetary value. • I am loved so much. This can't be accounted. This is flaw in financial accounting as it does not understand the human value. Generally Accepted AccountingPrinciples, Conventions andConcepts Historical Cost concept Assets are always shown at their cost an not at their current market value. Example:- • A land purchased for 5 Lakhs will be recorded only at Rs. 5 Lakhs eventhough market value may be lower say Rs. 4 Lakhs or higher Rs. 6 Lakhs than the cost price. Generally Accepted AccountingPrinciples, Conventions andConcepts Periodic Concept Income (Loss) of a business is measured periodically known as the accounting period. Example:- Calendar year - 01Jan - 31 Dec Financial year - 01 April to 31 march Generally Accepted AccountingPrinciples, Conventions andConcepts Matching Concept •Matching concept states that expenses that are incurred in an accounting period should be matching with the revenue earned during that period. As revenue and expenses are matched, the profit or loss is not over or under-stated. • Ex - Cost of Sale matched with Revenue (Sales) Identify the sales commission with sales Generally Accepted AccountingPrinciples, Conventions andConcepts Materiality Concept ❑Information is material if its misstatement could influence the economic decisions of users taken on the basis of the financial information. ❑Materiality should be treated individually and aggregate. ❑The amount (quantity) and nature (quality) misstatements both need considered in determining materiality. Example:- A calculator worth Rs.500 not recorded asset ratherthan charged off as an expenses even though the benefit is enduring in nature. Generally Accepted AccountingPrinciples, Conventions andConcepts Going Concern Concept • A business entity is assumed to carry on its operations for a foreseeable future. • Implies that the resources of the concern would continue to be used for the purposes for which they are meant to be used. Example:- An entity will not be started with an intention to close within the specified time period . Business is always not started with an intention to close and it is expected to continue forever. Generally Accepted AccountingPrinciples, Conventions andConcepts Consistency Concept There are number of methods available for treating an event and recording of it. Once the method is selected, it is essential to continue it for subsequent events in order to There should be a sound reason to preserve consistency. change the method. Example:- ➢Period shouldn't be changed frequently from Jan-Dec to Apr- Mar ➢Inventory valuation change from FIFO or Weighted Average not permitted frequently. NOTE: If any company decides to change the policy, then that company has to follow relevant accounting standard (LKAS 08 - Accounting Policies, Changes in Accounting and Errors ) Generally Accepted AccountingPrinciples, Conventions andConcepts Accrual concept In general it is assumed that accounts are always prepared based on accrual basis. However there are entities which follow cash basis of accounting also. Examples:- • Recognize the salary payable and interest payable in the financial statement. • Recognized trade receivable and trade payable in the FP • The company Law Act/ Income Tax Act prescribes all companies to follow Accrual Basis of Accounting except for Professional firms and government organization which are allowed to follow Cash Basis of Accounting. Generally Accepted AccountingPrinciples, Conventions andConcepts Realization Concept The concept of realisation states that revenue is realized at the time when goods or services are actually delivered (when satisfy the performance obligation). Example:- If a company is entered to a contract to deliver a machine to customer. Revenue should be recognized at the point of deliver. Generally Accepted AccountingPrinciples, Conventions andConcepts Prudence Concept the principle of not showing assets or profits to be greater than they might be, or losses to be smaller than they might be, in a company's accounts Example:- • Recognize provision for the trade receivable impairment • Recognize stock losses • Recognize gratuity provision expenses What are the concepts behind the below mentioned scenarios? • Closing stock of the company has been deducted from the cost - Matching concept • Owner's delivery van has been recorded in accounts on cost - Business entity concept • Company depreciates assets - Matching concept • Credit sale record as sales income - Accrualconcept •Company has used same dividend policy for five years- Consistency concept •They have capitalized the software they use - Material concept • Recognize closing stock at lower vale of cost or NRV - Prudence concept"
  },
  {
    "index": 2,
    "title": "2. Accounting Process  Preparation of Financial Statements",
    "content": "Accounting Process & Preparation of Financial Statements. MN 3043 - Business Economics andFinancial Accounting G.V.N.Mahimi Kanchana Faculty of Engineering University of Moratuwa Learning Outcomes Accounting Process Prime Entry Books Elements of Financial Statements Double Entry Method Statement Profit and Loss & Other Comprehensive Income Statement Financial Position Accounting Process Post in general ledger Record in prime entry books Identify transaction Prepare source documents Prepare trial balance Prepare financial statements Accounting Process Prime entry books/Journals Journals Purpose/Usage PurchasesJournal To record only credit purchases of goods by the trader Sales Journal To enter only credit sales of goods by the trader Purchases Return Journal To record the goods returned by the trader to suppliers Sales Return Journal To deal with goods returned (out of previous sales) by the customers Cash Receipt/Payment Journal To record only cash receipt and payment General Journal To record the entries which cannot be entered in any of the above listed subsidiary books Prime entry books/Journals Journals SourceDocument Purchases Journal Purchase Invoice Sales Journal Sales Invoice Purchases Return Journal Debit Note Sales Return Journal Credit Note Cash Receipt/Payment Journal Cash receipt /Payment Voucher General Journal Journal voucher Elements of financial stetments Asset - Definition Apresent economic resource controlled bythe entity as a result of past events. An economic resource is a right that has the potential to produce economic benefits Liability - Definition A present obligation of the entity to transfer an economic resource as a result of past events. An obligation is a duty or responsibility that the entity has no practical ability to avoid Equity - Definition Equity is the residual interest in the assets of the entity after deducting all its liabilities. Income - Definition Increases in assets, or decreases in liabilities, That result in increases in equity, other than Those relating to contributions from holders of equity claims. Expense - Definition Decreases in assets, or increases in liabilities, that result in decreases in equity, other than those relating to distributions to holders of equity claims Profit ❖Profit: Income - Expense Does cash flows and profit same ??? Cash Flows Cash Basis Profit Accrual Basis Principles of accounting Assets Expenses Increase Decrease Increase Decrease Debit Credit Debit Credit Principles of accounting, Cont.. Income Liability Decrease Increase Decrease Increase Debit Credit Debit Credit Principles of accounting Cont... Capital Decrease Increase Debit Credit Double entry system “Every business transaction has a two-fold effect and that it affects two accounts in opposite directions and if a complete record were to be made of each such transaction, it would be necessary debit one account and credit another account. It is this recording of the two fold effect of every transaction that has given rise to the term Double Entry System”. Accounting equation Assets = Capital Assets = Capital + Liability Assets = Capital + Profit + Liability Assets = Capital + (Income - Expenses) + Liability Assets + Expense = Capital + Income + Liability Debit Credit Exercise Mohan started business with Rs.50,000 as capital. Purchased furniture for cash Rs.5,000. He purchased goods for cash Rs.30,000. He purchased goods on credit for Rs.20,000. Goods costing Rs.25,000 sold on credit for Rent paid Rs.3,000. Required: Report the transactions under the equation Answer Capital + Income + Liability= Assets + Expenses +50,000(capital) +50,000(cash) +5,000(furniture) -5,000(cash) (iii) +30,000(goods) -30,000(cash) +20,000(tra de payable) + 20,000(goods) +35,000(sales income) -25,000(goods) +35,000(trade receivables) +25,000(Cost of sale) -3,000(cash) +3,000(rent) How to account a transaction 1. Kamindu started a business with investing Rs. 50,000 2. Obtained a bank loan amounting to Rs. 3. Purchases motor vehicle How to account a transaction CashAccount Capital Capital Account Cash How to account a transaction CashAccount Bank loan B. Loan 500,000 Cash How to account a transaction Motor vehicle Cash Cash account Trading Account The trading account calculates the amount of gross profit earned from buying and selling goods in a particular time period (usually one year). Preparations of Financial Statements Trading Account Cont... Cost of Sales: This calculation will work out the cost of all the goods that were sold in the year. It is calculated as follows Cost of sales = opening stock + purchases - closing stock. Opening stock: This is the value of stock left over from the previous year. This stock will be the first to be sold in the new year. Purchases: This is the cost of all the goods bought during the year. Additional costs may be added to purchases, carriage in and import duty. Purchase returns/returns out may have to be subtracted. Trading Account Cont... Closing stock: This is the value of all the goods left in the business at the end of the year. It is subtracted from opening stock and purchases, as it does not form part of the goods sold during the year. Gross profit: This measures the profit the business makes by buying and selling books. It is calculated as follows: Gross profit = Sales - Cost of Sales Format - Trading Account ..................................Business For the year ended 31st March 20xx TradingAccount Sales xxxx xxxx xxxx (xxxx) (xxxx) xxxxx (xxxxx) xxxxx less cost of sales Opening stock Purchases Carriage charges Less : Purchase returns Less closing stock Cost of sales Gross profit Profit and loss and other Comprehensive Income Statement (P&L and OCI) P&L. and OCI calculates the net profit of a business has earned after allowing for all the expenses relevant for a particular period. (P&L and OCI) Cont.... Administration expenses: These are the costs associated with running the business such as wages, insurance and electricity etc. Distribution expenses: These are the costs associated with selling the goods and delivering them. They include advertising, delivery van repairs and petrol etc. Financial expenses: These are the costs associated with borrowing money such as interest on the overdraft and the mortgage. (P&L and OCI) - Format Cont...................................... Enterprise For the year ended 31 March20xx Comprehensive Income Statement Gross Profit XXXX Other income Rent received Discount received Commissions received XXX Administrative expense Electricity Water Depreciation - Building Depreciation - Furniture Salary Rates Rent expense (xxx) Distribution expense Advertising Promotion expenses Sales expenses Depreciation - Motor vehicle (xxx) Finance Expense Bank charges Bank interests OD interests (xxx) Net profit xxxx Statement of Financial Position (SFP) Statement of a business's wealth of a particular date. Status of, Assets Liability Equity SFP Cont..... Non current assets: Current assets: SFP - Format Questions Answers"
  },
  {
    "index": 3,
    "title": "3. Statement of Changes of Equity  Statement of Cash Flow",
    "content": "Statement of Changes of Equity & Statement of Cash Flow. MN 3043 - Business Economics and Financial Accounting G.V.N.Mahimi Kanchana Faculty of Engineering University of Moratuwa Learning Outcomes At the end of the session, you should be able to; • Understanding equity changes • Preparing the statement of changes of equity for a company • Identify the cash inflows and outflows of a business organization • Identify the operating, investing and financing activities of a firm • Preparing the cash flow for a company • Recognize the advantages of preparing the cash flow Statement of Changes of Equity Purpose of Preparing Statement of Changes of Equity ✓Transparency through showing detailed changes not visible in the income statement or balance sheet alone. ✓Helps shareholders, investors, and management evaluate company stability, performance, and capital management. ✓Connects the income statement with the balance sheet by explaining movements in equity ✓Assess financial health & reveals how effective management is in generating profits and managing distributions to owners. ✓Discloses new capital contributions, profit retention, dividend policy, and capital withdrawals. (Track Capital Movements) ✓Offers clarity for investors and creditors about the company's ability to generate and retain value Factors Affecting Equity of a Company Profits earned during the period (increase equity). Losses incurred (decrease equity). Dividends declared and paid (decrease equity). Issue of new shares (increase equity). Share buybacks/redemptions (decrease equity). Changes in asset fair value booked directly to reserves (increase/decrease equity depending on revaluation direction) Format of Statement of Changes of Equity Cash Flow Statement Objectives of Cash Flow Statements • To highlight cash inflow and outflows from different activities • To understand the liquidity • Tomanage cash efficiently • To predict the weaknesses • To compare with budgets • To determine the ability to pay dividends to stockholders' and payments to creditors Definitions • Cash - Cash on hand and demand deposits • Cash equivalents Short term highly liquid investments that are readily convertible to known amounts cash and which are subject insignificant risk of changes in value • Cash flows - Inflows and Outflows of cash and cash equivalents Cash Flow Statement • A statement prepared by the business at the end of the accounting period which reports the cash inflows and outflows under classification of operating, investing and financing activities. • This statement reports cash inflows and outflows based on the firm's - Operating activities - Investing activities - Financing activities Cash Flow from Operating Activities Operating cash flow refers to the cash flow that results from the firm's day-to-day activities of producing and selling. The main revenue-producing activities of the entity that are not investing or financing activities, so operating cash flows include cash received from customers and cash paid to suppliers and employees. It would seem more logical to classify interest and dividend income as an“investing” inflow, while interest paid certainly looks like a “financing” outflow. Cash Flow from Investing Activities Investment cash flow refers to the cash flow that results from the firm's asset related activities. This activity involves in the acquisition and disposal of long-term assets and other investments that are not considered to be cash equivalents. Cash Flow from Financing Activities Financing activities that activity alter the equity capital and borrowing structure (Capital Financing Structure) of the entity. • The statement of cash flows is prepared by using; - Direct Method - Indirect Method • The only difference between two methods is, how cash flows from operating activities are calculated. Cash flows from investing and finance activities are calculated identically in both methods. • The net cash inflow from operating activities is the same whether statement prepared by direct or indirect method. Classification of CF statement Direct Method • Converts each item on the income statement to a cash flow that is sales are converted to cash receipts from sales etc. Practice Question 01 The details of the cash book of Ray Ltd as at 31/12/2025 is as follows. Prepare the cash flow statement under direct method Indirect Method Step 01 • Being with net income as reported on the income statement. Step 02 • Add back depreciation because these are non - cash expenses added back to income. Step 03 • Subtract gain on disposal of fixed assets and Interest Income because these are reported in investing activity of the statement. Step 04 • Add back loss on disposal of fixed assets - Report in investing activity. • Add back interest expenses Report financing activity. Step 05 Adjust for current assets and current liability. An increase in current asset is deducted from net income An increase in current liability is added to net income A decrease in current asset is added to net income An decrease in current liability is deducted from net income Step 06 • Arrive at net cash inflow or outflow from operating activities. Exercise - 01 From the summarized cash book of Zenith Ltd. shown below, calculate net cash flow from operating activities. Answer Exercise - 02 From the following profit and loss account of Samarth Ltd., calculate net cash flows from operating activities. Answer Exercise - 03 From the following information extracted from the book of Max Ltd. for the year 2019-20, calculate net cash flow from investing activities. Exercise - 03 Additional information is given as follows: •Depreciation charged on furniture during the year was $10,000 •Depreciation on machinery charged during the year was $25,000 •Machinery, the book value of which was $80,000, sold for $75,000 •Land was sold at a profit of $90,000 Answer Exercise - 04 From the following information acquired from Tarapoore Ltd., calculate net cash flows from financing activities for the year 2019-20. Note: Interest on debentures paid during the year was $30,000 and on bank loan $40,000. Answer Exercise - 05 Base Ltd. provides the following information to you. Calculate net cash flows from financing activities for the year 2019-20. Further information is given as follows: The company issued 5,000 bonus shares during 2019-20 to shareholders at face value Interest on debentures paid, in total, during the year was $60,000 Interest on bank loan paid during the year was $25,000 Dividends paid during the year amounted to $120,000 Answer"
  },
  {
    "index": 4,
    "title": "4. Financial Statement Analysis",
    "content": "Financial Statements Analysis G. V. N. Mahimi Kanchana Faculty of Engineering University of Moratuwa Learning Outcome Financial Statement Analysis. Tools & Techniques of Financial Statement Analysis Comparative Analysis Vertical Analysis Financial Ratio Analysis Process of Financial Statement Analysis Limitations of Financial Statement Analysis Financial Statement Analysis • Analysis of F.S is a systematic process of analyzing the financial information in the financial statements to understand and make decision regarding the operation of the enterprise. • Or it is study of relationship among various financial figures are set out in the financial statements. (ex: Balance Sheet & Statement of Profit and Loss) • The complex data given in these financial statement is divided or broken into simple and valuable elements and relationships are establishes between the elements of same statements or different F.S Tools & Techniques Analysis 1) Comparative Statements - means a comparative study of individual items or components of financial statements of two or more year of enterprise itself. o In comparative statement, amount of two or more years are placed side by side along with change in amounts in absolute and percentage terms to facilitate comparison. 2) Common Size Statements (Vertical Analysis) - means statement in which individual items of F.S of two or more years are placed side by side and thereafter converted into percentage taking a common base. o Common base normally taken is total of assets or liabilities. In the B.S, the total of assets or liabilities is taken as 100 and all the figures are expressed as percentage of total. o Similarly in the statement of profit & Loss, Revenue from operations i.e. Net sales is taken as 100 and all amounts are expressed as a percentage of Revenue from operations, Net sales. 3) Ratio Analysis - ratio is an arithmetical expression of relationship between two related or interdependent components of financial statements of an accounting period. Comparative Analysis • Comparative analysis, also known as comparative financial statement analysis, is a method of evaluating and comparing the financial performance and position of a company over multiple periods. It involves analyzing financial statements from different time periods, typically consecutive years, to identify trends, changes, and patterns in the company's financial data. • The primary objective of comparative analysis is to assess the company's financial progress, identify areas of improvement or concern, and make informed decisions based on the comparison of financial information. By examining changes in financial statement items over time, comparative analysis provides insights into the company's growth, profitability, efficiency, and financial stability. • There are three types of comparisons. Those are, ✓Intra Company basis ✓Inter Company basis ✓Industry averages Comparative Analysis Vertical Analysis • Vertical analysis, also known as common-size analysis, is a financial analysis method used to evaluate and compare the proportions and relationships of financial statement items within a single period. • It involves expressing each line item on a financial statement as a percentage of a common base, typically total revenue or total assets. • The primary objective of vertical analysis is to understand the composition and relative significance of each line item within a financial statement. • By presenting the data in a standardized format, vertical analysis allows for easy comparison of different components and facilitates the identification of trends, patterns, and potential areas of concern. Vertical Analysis • This helps stakeholders understand the composition and proportion of each line item within a financial statement. It allows for the identification of trends, anomalies, and potential areas of improvement or risk. • By analyzing the relative significance different components, vertical analysis facilitates decision-making, strategic planning, and the assessment of financial performance and position. Financial Ratio Analysis • Is a method or process by which the relationship of items or groups of items in the financial statements are computed and presented. • Financial ratio analysis is a quantitative technique used to evaluate a company's financial performance and condition. It involves calculating and interpreting various ratios derived from the financial statements to assess different aspects of the company's operations, profitability, liquidity, solvency, and efficiency. • Financial ratio analysis provides a snapshot of a company's financial health, helping stakeholders make informed decisions about investment, lending, or overall assessment of the company's financial position. It involves comparing the ratios of the company under analysis with industry benchmarks, historical data, or competitors to gain insights into its relative performance. Types of Ratio Analysis Liquidity Ratio • Liquidity ratios are a category of financial ratios that assess a company's ability to meet its short-term obligations and measure its overall liquidity or cash flow position. These ratios provide insights into a company's ability to generate cash quickly and efficiently to cover its immediate financial obligations. • Liquidity ratios are important for assessing the short-term financial health and stability of a company. They indicate the company's ability to pay off its current liabilities using its current assets or cash reserves. Lenders, creditors, and investors often analyze liquidity ratios to evaluate the company's ability to manage its short- term financial obligations and potential risks. • Analyzing liquidity ratios helps stakeholders understand the company's ability to manage its short-term financial obligations and provides insights into its overall financial stability and risk management. Liquidity Ratio Current Ratio • The current ratio compares a company's current assets to its current liabilities. It measures the company's ability to cover short-term obligations with its short-term assets. • A higher current ratio generally indicates a better short-term liquidity position, as it suggests the company has more current assets to cover its current liabilities. However, an excessively high current ratio may indicate an inefficient use of assets. Liquidity Ratio Quick Ratio (or Acid-Test Ratio) • The quick ratio is a more stringent measure of liquidity that excludes inventory from current assets. It provides a clearer picture of a company's ability to meet its short- term obligations without relying on the sale of inventory. • The quick ratio provides a more conservative assessment of liquidity, as it excludes inventory, which may not be quickly converted into cash. A higher quick ratio suggests better short-term liquidity. The cash ratio focuses solely on cash availability to cover short-term obligations. A higher cash ratio indicates a stronger ability to meet short-term liabilities using cash reserves. Liquidity Ratio Cash Ratio • The cash ratio is the most conservative liquidity ratio. It measures a company's ability to pay off its current liabilities using only its cash and cash equivalents. • The cash ratio focuses solely on cash availability to cover short-term obligations. A higher cash ratio indicates a stronger ability to meet short-term liabilities using cash reserves. Solvency Ratio • These financial ratios that assess a company's ability to meet its long-term debt obligations and measure its overall financial solvency or stability. These ratios provide insights into a company's ability to generate sufficient cash flow to cover its long-term debts and commitments. • Crucial for evaluating a company's long-term financial health and its capacity to sustain its operations and fulfill its financial obligations to creditors and investors. Lenders, creditors, and investors often analyze solvency ratios to assess the company's ability to manage its long-term debt and potential risks associated with its financial structure. • Depend on factors such as business cycles, capital intensity, and regulatory requirements. • This helps stakeholders assess the company's long-term financial stability, evaluate its ability to meet debt obligations, and gauge the level of financial risk. It provides insights into the company's capital structure, debt management strategies, and financial sustainability over the long term. Solvency Ratio Debt-to-Equity Ratio • The debt-to-equity ratio measures the proportion of a company's total debt to its shareholders' equity. It indicates the level of financial leverage or reliance on debt financing. • A higher debt-to-equity ratio suggests a higher proportion of debt relative to equity. It indicates that the company has a higher level of financial risk and may be more vulnerable to economic downturns or changes in interest rates. Solvency Ratio Debt Ratio • The debt ratio, also known as the total debt ratio, measures the proportion of a company's total assets that are financed by debt. • The debt ratio provides an indication of the company's overall financial risk and stability. A higher debt ratio suggests a higher reliance on debt financing and potentially a greater risk of insolvency. Solvency Ratio Interest Coverage Ratio • The interest coverage ratio evaluates a company's ability to meet its interest payments on its outstanding debt. • The interest coverage ratio measures the company's ability to generate sufficient earnings to cover its interest obligations. A higher ratio indicates a higher ability to meet interest payments and suggests a lower risk of default. Efficiency Ratios • Efficiency ratios, also known as activity ratios or asset management ratios, are financial ratios that measure a company's operational efficiency and effectiveness in managing its assets, liabilities, and resources. These ratios provide insights into how well a company utilizes its resources to generate sales, manage inventory, collect receivables, and generate profits. • These asses the company's operational performance, productivity, and effectiveness in utilizing its assets and resources • Different industries may have different norms and expectations for efficiency ratios due to variations in business models and operating dynamics. • Analyzing efficiency ratios helps stakeholders assess a company's operational efficiency, identify areas for improvement, and make informed decisions regarding resource allocation, inventory management, credit policies, and overall operational effectiveness. Efficiency Ratios Inventory Turnover Ratio • The inventory turnover ratio measures how efficiently a company manages its inventory by assessing how quickly it sells its inventory and replaces it. • A higher inventory turnover ratio indicates that the company is selling its inventory quickly and effectively, which suggests efficient inventory management and minimized carrying costs. However, an extremely high ratio may indicate stockouts and the need for better inventory planning. Efficiency Ratios Days Sales of Inventory (DSI) • Measures the number of days it takes for a company to sell its inventory. • A lower DSI suggests faster inventory turnover and efficient inventory management. Efficiency Ratios Accounts Receivable Turnover Ratio • The accounts receivable turnover ratio evaluates how efficiently a company collects its receivables from customers. • A higher accounts receivable turnover ratio indicates that the company is collecting its receivables more quickly, which suggests effective credit management and prompt collection of payments. It indicates the company's ability to convert credit sales into cash efficiently. Efficiency Ratios Days Sales Outstanding (DSO) • Measures the average number of days it takes for a company to collect payment from customers. • A lower DSO suggests faster cash conversion and efficient management of accounts receivable. Efficiency Ratios Asset Turnover Ratio • The asset turnover ratio measures how efficiently a company utilizes its assets to generate sales. • A higher asset turnover ratio indicates that the company is utilizing its assets effectively to generate sales revenue. It suggests better operational efficiency, effective resource utilization, and higher productivity. Efficiency Ratios Payable Turnover Ratio • The payable turnover ratio assesses how efficiently a company manages its trade payables or its payment to suppliers. • A higher payable turnover ratio suggests that the company is paying its suppliers promptly and efficiently, which indicates good supplier relationships, effective cash management, and potential negotiating power with suppliers. Efficiency Ratios Days Payable Outstanding (DPO) or creditor days • This is a financial ratio that measures the average number of days it takes for a company to pay its suppliers or trade payables. It provides insights into a company's payment practices and the efficiency of its account's payable management. • A higher payable days ratio indicates that the company takes longer to pay its suppliers, potentially preserving cash or extending its payment terms. However, it could strain supplier relationships if payments are excessively delayed. Conversely, a lower payable days ratio suggests that the company pays its suppliers more promptly. Efficiency Ratios Cash Conversion Cycle (CCC) • Measures the time it takes for a company to convert its investments in inventory and other resources into cash from sales. • A lower CCC indicates faster conversion of investments into cash and more efficient working capital management. Profitability Ratio • Profitability ratios are financial ratios that measure a company's ability to generate profits relative to its sales, assets, equity, and other factors. These ratios provide insights into a company's overall profitability and its ability to generate a return on investment for its stakeholders. • Profitability ratios are crucial for assessing a company's financial performance and determining its ability to generate sustainable profits. They are widely used by investors, lenders, and analysts to evaluate a company's profitability, compare it with industry peers, and make informed investment or lending decisions. • Profitability ratios can vary significantly across industries due to different business models, cost structures, and industry dynamics. • These ratios provide insights into the company's operational efficiency, pricing strategies, cost management, and overall financial health. Profitability Ratio Gross Profit Margin • Measures the profitability of a company's core operations by calculating the percentage of sales revenue remaining after deducting the cost of goods sold. • A higher gross profit margin indicates that the company is generating more profit from its core operations. Profitability Ratio Operating Profit Margin • Evaluates the profitability of a company's operations by measuring the percentage of operating income relative to its revenue. • A higher operating profit margin indicates that the company is generating more profit from its core business activities, excluding non-operating expenses. Profitability Ratio Net Profit Margin • Measures the overall profitability of a company by calculating the percentage of net income relative to its revenue. • A higher net profit margin indicates that the company is generating more profit after considering all expenses, including taxes and interest. Profitability Ratio Return on Assets (ROA) • Assesses the profitability of a company's assets by measuring the percentage of net income relative to its average total assets. • A higher ROA indicates that the company is generating more profit per dollar of assets employed. Profitability Ratio Return on Equity (ROE) • Measures the profitability of a company's shareholders' equity by calculating the percentage of net income relative to average shareholders' equity. • A higher ROE indicates that the company is generating more profit per dollar of shareholders' equity invested. Investor / Market Value Ratio • Investor/market value ratios, also known as market valuation ratios, are financial ratios that provide insights into how investors perceive a company's value in the market. These ratios assess the relationship between a company's stock price and its earnings, book value, or other financial metrics. • Investor/market value ratios are commonly used by investors, analysts, and market participants to evaluate a company's attractiveness as an investment and compare it with industry peers. • These investor/market value ratios help investors assess a company's attractiveness as an investment and evaluate its valuation relative to its financial performance, market expectations, and industry peers. • It's important to note that these ratios should be analyzed in conjunction with other financial and qualitative factors to gain a comprehensive understanding of a company's investment potential. Investor / Market Value Ratio Earnings per Share (EPS) • Represents the portion of a company's profit allocated to each outstanding share of common stock. • EPS provides insights into a company's profitability on a per-share basis. Higher EPS may indicate higher earnings potential and attractiveness to investors. Investor / Market Value Ratio Price-to-Earnings Ratio (P/E Ratio) • Compares a company's stock price to its earnings per share (EPS). • The P/E ratio reflects the market's expectations and investors' willingness to pay for a company's earnings. A higher P/E ratio suggests higher investor confidence and expectations of future growth. Investor / Market Value Ratio Price-to-Book Ratio (P/B Ratio) • Compares a company's stock price to its book value per share. • The P/B ratio indicates the market's valuation of a company relative to its net assets. A higher P/B ratio suggests that investors are willing to pay a premium for the company's book value. Investor / Market Value Ratio Dividend Yield • Measures the annual dividend income generated by a company's stock relative to its market price. • Dividend yield indicates the return on investment through dividends. A higher dividend yield may be attractive to income-seeking investors. Process of Financial Statement Analysis The process of financial statement analysis involves examining a company's financial statements to gain insights into its financial performance, position, and overall health. Here are the steps typically followed in the process: ✓Gather Financial Statements: Obtain the company's financial statements, including the balance sheet, income statement, and cash flow statement. These statements provide a comprehensive view of the company's financial performance and position. ✓Review the Financial Statements: Thoroughly examine the financial statements to understand the company's revenue, expenses, assets, liabilities, and equity. Pay attention to the notes and disclosures accompanying the statements for additional information. Process of Financial Statement Analysis ✓Perform Horizontal Analysis: Conduct a horizontal analysis by comparing financial data over multiple periods. This helps identify trends, changes, and patterns in the company's performance over time. Calculate the percentage changes between periods for key line items. ✓Conduct Vertical Analysis: Perform a vertical analysis by expressing each line item on the financial statements as a percentage of a base figure, typically total revenue or total assets. This allows for a comparison of the composition and relative significance of different items. ✓Calculate Financial Ratios: Compute various financial ratios that provide insights into the company's liquidity, profitability, solvency, and efficiency. Calculate ratios such as liquidity ratios, profitability ratios, leverage ratios, and efficiency ratios. Compare these ratios with industry benchmarks and historical performance to assess the company's financial health. Process of Financial Statement Analysis ✓Interpret and Analyze Results: Interpret the financial ratios and trends observed in the analysis. Look for strengths, weaknesses, opportunities, and threats in the company's financial position. Identify areas where the company is performing well and areas that may require attention or improvement. ✓Conduct Comparative Analysis: Compare the company's financial performance with industry peers or competitors to gain insights into its relative standing. Benchmarking against industry standards helps identify areas where the company may be outperforming or underperforming. ✓Consider Qualitative Factors: While financial statement analysis focuses on quantitative data, it's essential to consider qualitative factors such as industry dynamics, market trends, management quality, competitive advantages, and regulatory environment. These factors provide a broader context for understanding the financial results. Process of Financial Statement Analysis ✓Draw Conclusions and Make Recommendations: Based on the analysis and interpretation of the financial statements, draw conclusions regarding the company's financial health, strengths, weaknesses, and areas for improvement. Make recommendations for management, investors, or other stakeholders based on the findings. ✓Monitor and Update Analysis: Financial statement analysis is an ongoing process. Continuously monitor the company's financial performance, update the analysis periodically, and adjust recommendations needed based changing circumstances. Limitations of Financial Statement Analysis • Historical Analysis • Ignores Price level Changes • Qualitative Aspect ignored • Suffer from the limitation of Financial statements • Variation in accounting Practices • Manipulation and Fraud • Incomplete Information • Lack of Context Walker Ltd Statement of Financial Position as at 31 March Horizontal Analysis Current Assets Bank Accounts receivable Inventory Non-current assets Fixtures & fittings (net) Land & buildings (net) Total assets Current Liabilities Accounts payable Income tax Non-current liabilities Loan Shareholders Funds Paid-up ordinary capital Retained profit Total liabilities & equity Walker Ltd Statement of Financial Performance for year ended 31 March Horizontal Analysis Sales Less Cost of goods sold Gross profit Wages & salaries Rates Heat & light Insurance Interest expense Postage & telephone Depreciation - Buildings Fixtures & fittings Net profit before tax Less Income tax Net profit after tax Walker Ltd Statement of Cash Flows for the year ended 31 March Cash flow from operations Receipts from customers Payments to suppliers & employees Interest paid Tax paid Net cash flow from operating activities Investing activities Purchase of non-current assets Net cash used in investing activities Financing activities Dividends paid Issue of ordinary shares Repayment of loan capital Net cash outflow from financing activities Increase in cash & cash equivalents Additional information: Credit purchases for the year were General prospects for the major industries which Walker involved look good with forecast glut oil set reduce the cost production and world demand for plastic remaining strong. Benchmarks: There are exact benchmarks for Walker Ltd because diversified company. The following are average indicators that relate the plastic retailing and manufacturing industries for the year Gross profit margin25% Net profit margin Inventory turnover times Debt/equity ratio - Return Assets - Return Equity Profitability ratios: Benchmarks Gross Profit Margin Industry 25% Net Profit Margin Industry 7% Return on Assets Return on Equity Industry 20% Asset Management ratios: Benchmarks Inventory Turnover Industry 5.8 times 5.58 times Asset Turnover Not given Relevant Ratios Important note: The calculations of the ratios in this illustration did not use “averages” for total assets, equity and inventory. The 2022 and 2023 year end figures were used and this is a slight variation to the formulas provided. Relevant Ratios Liquidity ratios: Benchmarks Current Ratio Ideal standard 2:1 Acceptable standard Quick Ratio Ideal standard 2:1 Acceptable standard Days Payable Standard 30 days Credit purchases not available 49.19 days Financial Structure ratios: Benchmarks Debt/Equity Industry 0.6:1 Standard benchmark TIE Standard benchmark: Between 3 and 5. Below 3 risky. Above 5 very favorable 10.14 times 39.74 times Report • For the investor considering the purchase of shares in the company, the return they will earn is the key financial factor but an overall evaluation of the company's performance and position is also important to get a better picture of how well the company is actually doing. • ROE in 2023 is 26%. Whether or not this is attractive depends on the perceived riskiness of this investment and other alternatives available but this return is certainly more attractive than current bank interest rates. • ROE has decreased by 4% but the company's ROE at 26% is still better than the industry average of 20% • Riskiness of business is being reduced by the significant repayment of loan in 2023. Profitability - The NP% and ROA ratios show a small downward trend in % over the 2 year period. ROE% ratio show a more significant decrease but is still better than the industry average. - Gross Profit Margin is slightly unfavorable at about 2.3% below the industry benchmark of 25%. - The horizontal analysis information show that Sales have increased by 20%. However operating costs have increased by Asset Management - IT has gone down slightly from 5.8 to 5.58 times. - IT is still close to the industry benchmark of 6 times. - AT has increased showing more sales being generated from asset usage • Liquidity - Current ratios of 1.78:1 (2022) and 1.70: 1 are at above acceptable levels but below ideal level. - Quick ratios appear more of a concern being below acceptable levels in both years and even more so in 2023 - Raises some concerns over the liquidity of the business and inventory management (although IT ratio only shows a slight decline in 2023). - Days Payable is a concern as there may be poor debt payment management. • Financial Structure - Although slightly higher than D/E industry benchmark (0.67:1), business has become less risky due to the significant repayment of loan in 2023. - TIE is extremely good for the business at 39.74 times (well above 5 the standard benchmark). • Cash flow situation - Strong cash flow from operating activities (increased from - Spending under investing activities suggest more growth. - Repayment of debt under financing activities imply restructuring of business to have more equity funding rather than debt funding. Given: The strong forecast for the industry (ie general prospects looking good and world demand for plastic products remaining strong), The sales growth in this business, Acceptable ratios as they are quite close to the industry averages, Good cash flows from operating activities and Favorable ROE, although it has decreased, it is still better than the industry average ROE. It is recommended that the investor purchase shares in the Walker Ltd company. Recommendation"
  },
  {
    "index": 5,
    "title": "5. Management Accounting Concepts  OH Costing",
    "content": "INTRODUCTION TO MANAGEMENT ACCOUNTING MN. 3043 - Business Economics and Financial Accounting G.V.N.Mahimi Kanchana Faculty of Engineering University of Moratuwa Learning Outcomes Analyze the nature, scope and utility of cost accounting. Examine how cost accounting arises out of the need to make business decisions. Identify the difference between cost, management and financial accounting. To familiarize with costing terminology. Recognize Direct and Indirect cost with a cost unit What is Management Accounting? Management accounting is concerned with the provision and use of accounting information to managers withinorganizations, to facilitate the managers in their decision making and management control functions. Financial Accounting focuses on preparing information for the use of external decision makers. Management Accounting focus the requirements Managers within the organization & the information they require making decisions. Financial Accounting Vs. Management Accounting Financial Accounting Management Accounting Principal Objectives Stewardship or business forthe benefit of shareholders Seek to improve economy, efficiency and effectiveness of operations Time horizon Past Not only look at the past,but the present and the future which affects the operationof the company Report recipients External/ Outsiders namely Shareholders and Government(tax) Internal parties likeDirectors and Managers Financial Accounting Vs. M.A.Contd... Outputs Summary (usually annual) statement of profit and loss and other comprehensive income , statement of financial position and statement of cash flow Detailed monthly and annual management accounts showing results by product and function adhoc reports Regulating framework Accounting standards, Accounting concepts plus statutory requirement by the companiesAct None prescribed CostAccounting ❑Cost refers to the value of resources sacrificed to achieve a specific objective, such as manufacturing, acquiring a good or providing a service or it means the amount of expenditure incurred on, or attributable to a given thing. Usually, cost measured monetary terms. ❑Cost Accounting is a systematic set of procedures for recording and reporting measurements of the cost of manufacturing goods and performing services in the aggregate and in detail. Management Accounting activities include; Explaining production & non-production costs & how they are reported in the financialstatements. Computing the costs of providing a service or manufacturing a product. Determining the behavior of costs & expenses as activity levelschange. Analyzing cost-volume profit relationships withina Company. Assisting management in profit planning & budgeting. Providing a basis for controlling costs & expenses by comparing actual results with planned objectives & standard costs. Accumulating & presenting relevant data for management decision making. Cost Terms ➢Cost Unit ➢Cost centre ➢Relevant cost ➢Irrelevant cost ➢Opportunity cost ➢Standard cost ➢Sunk cost Cost Unit Unit of quantity of product, service or time in relation to which costs may be ascertained or expressed. ✓Telecommunication - a minute ✓Bread production - a bread ✓Apartment Complex - a single apartment Cost center Cost center means “a location, person or item of equipment (or group of these) for which costs may be ascertained and used for the purpose of cost control.” The Chartered Institute Management Accountants, Relevant Cost A managerial accounting term that is used to describe costs that are specific to management's decisions. The concept of relevant cost eliminates unnecessary data that could complicate the decision making. Irrelevant Cost A managerial accounting term that represents a cost, either positive or negative, that does not relate to a situation requiring management's decision. Types of Relevant and Irrelevant Cost Opportunity Cost The cost of an alternative that must be forgone in order to pursue a certain action. Put another way, the benefits you could have received taking alternative action. Standard costs The standard cost is a production or operating cost that is carefully predetermined. A standard cost is described as a predetermined cost, an estimated future cost, an expected cost, a budgeted unit cost, a forecast cost, or as the “should be” cost. Standard costs are often an integral part of a manufacturer's annual profit plan and operating budgets. It is a target cost that should be achieved. ➢A cost that has already been incurred and thus cannot be recovered. ➢A sunk cost differs from other, future costs that a business may face, such as inventory costs or expenses, because has already happened. ➢Sunk costs are independent of any event that may occur in the future. Sunk cost Classification of costs 1. Function wise classification 2. Elements wise Classification 3. Behavior wise Classification Classification of costs cont... Function wise classification (Their ease of traceability) Direct cost Direct material cost Direct labour cost Direct other cost Indirect cost Production overheads Non-production overheads Administrative expenses Selling and distributionexpenses Finance and Other expenses Direct Cost vs. Indirect Cost • Direct cost refers to the cost that can be specifically and exclusively identified with a particular cost object. • Indirect cost can't specifically and exclusively identified with the cost object. Production Overhead Cost Manufacturing costs that cannot be traced directly to specific units produced. Examples: Indirect Labor , Indirect Materials & other Wages paid to employees who are not directly involved in production work. Examples: maintenance workers, janitors and security guards. Materials used to support the production process. Examples: lubricants and cleaning supplies used in the automobile assembly plant. Classification of costs cont... 2. Elements wise classification ➢Material Cost ➢Labor Cost ➢Other cost Material Cost Those materials that become an integral part of the product and that can be conveniently traced directly to it. Invoice price xxxx (-) Trade discount (xxx) Freight chargers xxxx Excise duty xxxx Non-refundable VAT xxxx Non-returnable Container charges xxxx Cost of Material XXXX The following quotation received from Mr. Nuwan in respect of a material item; Lot price, ▪2000 units Rs. 5.00 each ▪4000 units Rs. 4.75 each ▪6000 units Rs. 4.00 each ▪Trade discount 25% and Cash discount 5% ( if settled within 10 days) ▪Freight charges per order Rs. 2,000 Containers charged Rs. 10 each ▪One container is required for every 100 units. Calculate the material cost for 6000 units. Practice Question 01 Labor Cost Those labor costs that can be easily traced to individual units of product. Other cost Those costs that can be easily traced to individual units of product other than Material and labor. Examples: ➢Royalty fee ➢Production license fee Classification of costs contd... 3. Behavior wise classification Variable costs Fixed costs ➢Semi-variable costs (Step cost) Variable and Fixed Cost Behaviour Cost InTotal PerUnit Variable Total variable cost changes as activity level changes. Variable cost per unit remains the same over wide ranges of activity. Fixed Total fixedcostremainsthe same even when the activity level changes. Fixedcostper unitgoes downas activitylevelgoes up. Semi -Variable Cost Behaviour Semi-variable cost is an expense which contains both a fixed-cost component and a variable-cost component. Example Electricity expenses Telephone expenses Total Production cost The summation of the prime cost and manufacturing overhead is termed as total manufacturing cost, and it can be depicted as follows; Direct material cost xxx Direct labor cost xxx Direct other cost xxx Prime cost xxx Production overhead cost xxx Total Production cost xxx Total Production cost Total Cost Manufacturing /Production Cost Direct Material Direct Labour Variable Manufacturing OH Fixed Manufacturing OH Non- Manufacturing / Non - Production Cost Variable Non-manufacturing OH Fixed Non-manufacturing OH Total Manufacturing Cost Any expense incurred after completion of the manufacturing and expense incurred not for production Total Cost Manufacturing /Production Cost Direct Material Direct Labour Variable Manufacturing Fixed Manufacturing Non-Manufacturing/ Non - Production Cost Variable Non- manufacturin Fixed Non- manufacturin Manufacturing Cost • Direct Material - cost of wood , cost of cushion, cost of paint • Direct Labour - carpenter's salary, labour cost of painting, labour cost of cutting • Variable Manufacturing OH - Electricity incurred for factory • Fixed Manufacturing OH - Factory rent, Production Manager's salary Non-manufacturing OH Cost • Variable Non-manufacturing OH - Admin office electricity, commission paid for sales rep based on number of units sold • Fixed Non-manufacturing OH - Sales manager salary, admin office rent Cost Object : Chair OVERHEAD COSTING. The total cost indirect materials, indirect labour and indirect expenses. What is overhead? Production overhead cost/ common cost would allocated each unit production through; (1) Allocation (2) Apportionment (3) Absorption Overhead cost distribution to product Cost centre is a responsibility centre where managers are accountable for the expenses that are under their control. It's a location, person or item that possible to collect cost. Cost centers classification: • Production cost centres • Service cost centres • Process cost centres Cost allocation and cost apportionment are the two procedures which describe the identification and allotment of costs to cost centers or cost units. Cost allocation refers to the allotment of all the items of cost to cost centers or cost units. An expense which is directly identifiable with a specific cost centre is allocated to that centre. Cost apportionment refers to the allotment of proportions of items of cost to cost centers or cost units based on equitable basis. Cost allocation and Cost apportionment Basis of apportionment (Source: Paramjit Sharma - www.scribd.com) Rent, Rates & Taxes, Lighting & Heating, Insurance & depreciation of Building, Air Conditioning FloorArea Occupied Capital Value Insurance & depreciation on Plant & Machinery (PM), Maintenance of PM and etc. (Source: Paramjit Sharma - www.scribd.com) Employee Machine Hours Welfare Expenses, time-Keeping, payroll Office, Canteen, Recreation, Supervision Medical Expenses Basis of apportionment Repairs & Maintenance of Plant & Machinery and Power Store Keeping Transport Service Value or Weight of Materials Truck Mileage Tonnage Truck No.of Pakages (Source: Paramjit Sharma- www.scribd.com) Store Keeping Expenses Basis of apportionment Transport Service Expenses Production Departments Service Department Factory Overheads Allocation & Apportionme Production Departments Service Departments Carry out the central purposes of an organization. Provide support that facilitates the activities of production departments. Service Department Cost Re-Apportionment The Need for CostApportionment First Stage Re- apportionment Service department costs are reapportioned to operating departments. Service Department (Cafeteria) Service Department (Accounting) Service Department (Personnel) Operating Department (Machining) Operating Department (Assembly) Re- apportionment basis Purchase Department Stores No of Purchase Orders or Value of materials purchased for each production department Value or Quantity of Materials Issued Materials Requisitions Re- apportionment basis Internal transport Inspection Inspection hours devoted to each department Weight & Distance There are several method of re- apportioningthe service department overheads to production departments 1. Direct method 2. Step down method 3. Reciprocal method ➢Repeated distribution method ➢Simultaneous Equation method (Equation Method) Methods of Re - apportionment ❑Under this method, the costs of service departments are directly apportioned to production departments without taking into consideration any service from one service department to another service department. Thus, proper apportionment cannot be done and the production departments may either be overcharged or undercharged. ❑This method is good when service department are not providing service to another service department/s. 1 . Direct method of Re apportionment 2. Step down method This approach is best used where some service cost centres provide services to other service cost centres, but these services are not reciprocated. Simultaneous Equation Method Setup the overhead reapportionment process as a set of equations. Let A= the total overhead apportioned to department B= the total overhead apportioned to departmentB, etc. 3. Reciprocal method Repeated distribution Method Under this method, the totals service department cost reputedly re allocate among other department based on the given basis (percentage) until cost each service department become too smaller or negligible. 3. Reciprocal method"
  },
  {
    "index": 6,
    "title": "6. Cost Volume Profit Analysis",
    "content": "Absorption Costing and ABC Costing Ms. Mahimi Kanchana Faculty of Engineering University of Moratuwa Absorption Costing is a method for sharing overheads between a number of different products on a fair basis. 3 stages of absorption costing; (1) Allocation (2) Apportionment (3) Absorption Allocation andApportionment Cost allocation refers to the charging of discrete identifiable items of cost to cost centres or cost units. Cost apportionment involves the division of cost amongst two or more cost centres in production. OverheadAbsorption It is a systematic process of distributing the OH, (allocated, apportioned and reapportioned to production department) among the units produced. Absorption rate - A rate at which overheads are charged to the cost units. OVERHEAD ABSORPTION RATE. Actual rate Predetermined overhead rate Actual and predetermined OAR The purpose absorbing production overheads is to ensure the full production cost of the product is known. If actual overheads and activity levels were to be used, it would only be known at the end of period. For this reason predetermined or budgeted figures are normally used to calculate absorption rates. Predetermined OAR The budgeted production overhead for each production cost center is then divided by the budgeted level of activity to give the predetermined overhead absorption rate (OAR). This OAR can then be used for planning and control purposes and also pricing. Budgeted OHEs for the Period Budgeted basis Predetermined OAR Pre-determined Rate OVERHEADABSORPTION RATE. Actual OHEs for the period Actual Basis Actual OAR Methods of overhead absorption Basis Production unit method Percentage methods % on direct labour % on direct material cost % on prime cost III. Hourly rate methods Direct labour hour rate Machine hour rate 1. Production unit method OHAR = POH. for the period No. of units of output OHAR POH. for the period x 100 Direct labour cost 2. Percentage on direct labour 3. Percentage on direct material cost OHAR = POH. for the Period x 100 Direct material cost 4. Percentage on prime cost OHAR = POH. for the period x 100 Prime Cost 5. Direct labour hour rate OHAR POH. for the period Labour hours 6. Machine hour rate OHAR POH. for the period Machine hours Only one Rate for entire Unit/plant /Department Single or Blanket overhead absorption Blanket overhead absorption is where the total production overheads of the organization are absorbed on a single absorption basis. The reasons for under/over absorbed overhead ✓Actual overhead costs are different from budgeted overheads. ✓The activity level is different from the budgeted activity level. ✓Both actual overhead and activity level are different from budget. ABC Costing What is ABC Costing? Activity-based costing (ABC) is a costing method that assigns overheads costs to related products and services. This accounting method of costing recognizes the relationship between indirect costs, overhead activities assigning indirect costs to products less arbitrarily than traditional costing methods. Concepts Activities - Aggregation of many different tasks, events or units of work that cause the consumption of resources. Activity Cost Pool - the overhead cost attributed to a distincttype of activity For example Cost Drivers - Any factor which causes a change in the cost of an activity. Indirect cost Activity Cost driver Set up costs Set upping Number of production runs Production scheduling cost Scheduling Number of production runs Material handling cost Material handling Number of production runs Inspection costs Inspection Number of inspections Raw material inventory handling cost inventory handling Number of purchase order delivered Dispatch costs Dispatching Number of customer order delivered Steps in ABC Costing System Activity-based costing involves the following four steps: Identify and classify the major activities and allocate manufacturing overhead costs to the appropriate cost pools. Identify the cost driver that has a strong correlation to the costs in the cost pool. Compute the overhead rate for each pool. Assign overhead costs for each costs to products using the overhead rates. Absorption Costing vs. ABC Absorption (Traditional) ABC Small number of cost centers Greater number of activity cost centers Small number of cost drivers Greater number of cost drivers Allocate OH to cost centers and then service dept. cost again to production Assign cost to major activities OH allocation rates are applied Cost drivers are applied Benefits of ABC costing ➢Easily identify the root causes of poor financial performance ➢Identify most and least profitable products and channels ➢Accurately predict the cost ➢Track costs of activities ➢Facilitate a better marketing mix ➢Enhancing the bargaining power with the customer Activity Base Management (ABM) ❑An extension of ABC from a product costing system to a management function that focuses on reducing costs and improving processes and decision making. ❖Value-added activities ❖Non-value-added activities Marginal Costing and Cost Volume Profit (CVP) Analysis MN 3043 - Business Economics & Financial Accounting G.V.N.Mahimi Kanchana Faculty of Engineering University of Moratuwa Learning Outcomes Understand the Marginal Costing Understand the AbsorptionCosting Distinguish between marginal costing and absorption costing Cost Volume Profit Analysis. Determine BEPand Margin of Safety Prepare different types of breakeven charts Understand the limitations of breakeven analysis Practice Questions Total Manufacturing Cost Any expense incurred after completion of the manufacturing and expense incurred not for production Total Cost Manufacturing /Production Cost Direct Material Direct Labour Variable Manufacturing Fixed Manufacturing Non-Manufacturing/ Non - Production Cost Variable Non- manufacturin Fixed Non- manufacturin Product Costing Product costing is the process of determining the cost of a unit of production through studying the resource utilization for it. Product Costing Marginal Costing Absorption Costing Marginal Costing • Marginal costing costing technique where only variable or direct cost will be charged to the cost unit produced. • In Marginal costing, fixed costs are never charged to production. They are treated as period charge and is written off to the comprehensive income statement (P&L) in the period incurred. Marginal Costing Cont. Marginal costing is a cost accounting system is significantly different from absorption costing. Under variable or direct costing, the fixed manufacturing overhead costs are not allocated assigned (not absorbed by) the products manufactured. Variable costing is often useful for management's decision- making. Marginal Cost - Cost of one additional unit of output Marginal Cost Calculation The additional cost needed to produce one more unit of a good or service = Direct Material Cost per Unit XXX Direct Labour Cost per Unit XXX Other Variable Cost per Unit XXX Marginal Cost per Unit XXX Example : Total cost of Producing 100 Burgers is Rs. 50,000. If the total production is 101 units, the total cost is Rs. 50,500. The Marginal cost of producing the next burger is Rs. Absorption Costing • Absorption costing is that all manufacturing costs are absorbed by the units produced. In other words, the cost of a finished unit in inventory will include direct materials, direct labor, and both variable and fixed manufacturing overhead. As a result, absorption costing is also referred to as full costing or the full absorption method. • Absorption costing is required for external financial reporting and for income tax reporting. Cost Classification - Absorption vs. Marginal Product Cost Direct materials Direct Labor VariableManufacturing overhead Product Cost Fixed manufacturing overhead Period Cost Period Cost Variable non-manufacturing OH expenses Fixed non-manufacturing OH expenses Absorption Costing Marginal Costing Question 01 Asmall company that produces a single product has thefollowing cost structure. No. of units produced Variable costs perunit: Direct materials Direct labor Variable manufacturing overheads Variableselling & administrativeexpenses Fixed cost peryear: Fixed manufacturing overhead Fixed selling & administrative expenses 1.Compute the unit product cost and total cost under absorption costing method. 2.Compute the unit product cost and total cost under marginal costingmethod. CVP Analysis •Breakeven analysis cost-volume-profit (CVP) analysis is the study of the interrelationships between costs, volume and profit at various levels of activity. • The breakeven point occurs when there is neither a profit nor a loss and so fixed costs equal contribution. Breakeven analysis is a financial tool used to determine the level of sales a business needs to achieve in order to cover all its costs, resulting in neither profit nor loss. It is a calculation that helps a business determine the point at which their revenue equals their expenses. The breakeven point is important for businesses because it helps them understand their profitability and plan for the future. By knowing their breakeven point, a business can calculate how much revenue they need to generate to make a profit and plan accordingly. The breakeven point can be calculated for a single product or service, or for an entire business. The formula for breakeven analysis is: Breakeven Point = Fixed Costs ÷ (Price - Variable Costs) Fixed costs are expenses that do not change regardless of how many units of a product or service a business produces, such as rent or salaries. Variable costs are expenses that change with the level of production, such as the cost of raw materials or sales commissions. Price is the amount of money a business charges for its product or service. Breakeven Analysis Conducting a breakeven analysis is crucial for new business development plans for several reasons: 1.Financial Planning: Breakeven analysis helps new businesses plan their finances by determining the minimum amount of revenue they need to generate in order to cover their costs. This helps businesses set prices for their products or services and create realistic financial projections. 2.Risk Assessment: Knowing the breakeven point helps businesses assess the risk associated with their new venture. If the breakeven point is too high, it may be difficult for the business to become profitable, and the venture may not be worth pursuing. 3.Strategy Development: Breakeven analysis can inform a business's strategic decisions. For example, if the breakeven point is high, the business may need to focus on reducing costs or increasing prices to become profitable. Alternatively, the business may need to focus on increasing sales volume to reach the breakeven point. 4.Investment Decisions: Potential investors or lenders will want to see a breakeven analysis to determine the viability of the business. A breakeven analysis can demonstrate to investors that the business has a solid financial plan and is a worthwhile investment. Overall, conducting a breakeven analysis is a valuable tool for new businesses to understand their financial position and make informed decisions about their pricing, costs, and profitability. Importance of Breakeven Analysis 1.Fixed Costs: These are the costs that do not vary with the level of production or sales. Examples include rent, salaries, insurance, and equipment leases. 2.Variable Costs: These are the costs that change with the level of production or sales. Examples include raw materials, direct labor, and sales commissions. 3.Total Cost: This is the sum of fixed costs and variable costs for a given level of production or sales. 4.Price per Unit: This is the price that a business charges for each unit of its product or service. 5.Variable Cost per Unit: This is the amount of variable cost that is associated with each unit of production or sale. 6.Contribution Margin: This is the amount by which the price per unit exceeds the variable cost per unit. It represents the amount of revenue that is available to cover fixed costs and contribute to profits. 7.Breakeven Point: This is the point at which the total revenue generated by a business is equal to its total costs. At this point, the business has neither made a profit nor incurred a loss. 8.Margin of Safety: This is the difference between the actual level of sales and the breakeven point. It represents the cushion or buffer that a business has before it starts to incur losses. Definitions of Important Terms Contribution Contribution is fundamental to CVP analysis. As you know, contribution per unit is the difference between selling price per unit and variable costs per unit. Contribution = Selling price - Variable cost Breakeven analysis works by calculating the point at which a business's total revenue is equal to its total costs, resulting in neither profit nor loss. At this point, the business has \"broken even.“ Total Revenue = Total Cost = Breakeven Point To calculate the breakeven point, the following formula is used: Breakeven Point = Fixed Costs / (Price per Unit - Variable Costs per Unit) Where: ✓Fixed Costs: These are the expenses that do not change with the level of production, such as rent, salaries, and insurance. ✓Price per Unit: This is the amount of money a business charges for each unit of its product or service. ✓Variable Costs per Unit: These are the costs that change with the level of production, such as the cost of raw materials or labor. Once the breakeven point is calculated, a business can use this information to make important decisions. For example, if the breakeven point is too high, the business may need to consider lowering its fixed costs or increasing its prices to achieve profitability. Alternatively, if the breakeven point is low, the business may be able to focus on increasing sales volume to achieve profitability. How to Conduct Breakeven Analysis Breakeven Point The breakeven point is the 'level of activity at which there is neither profit nor loss'. At this stage; TR = TC BEP. ( units) = Fixed Cost Contribution per unit BEP (Sales value) = Fixed Cost CS/ PV ratio The contribution/sales (C/S) ratio, or profit/volume (P/V) ratio, is a measure of how much contribution is earned from each Rs. 1 of sales. CS / PV Ratio = Contribution x 100% Sales BEP at Target Profit level Formulas Assume a small business sells a single product for Rs.50 per unit. The variable costs per unit are Rs.25, and the fixed costs for the business are Rs.10,000 per month. To calculate the BEP, we can use the formula: BEP = Fixed Costs / (Price per Unit - Variable Costs per Unit) First, we calculate the contribution margin, which is the difference between the price per unit and the variable costs per unit: Contribution Margin = Price per Unit - Variable Costs per Unit Contribution Margin = Rs.50 - Rs.25 Contribution Margin = Rs.25 Next, we can calculate the breakeven point: BEP = Rs.10,000 / Rs.25 BEP = 400 units This means that the business needs to sell 400 units of its product each month to break even and cover its fixed and variable costs. Example To calculate the total revenue at the breakeven point, we can simply multiply the breakeven quantity by the price per unit: Total Revenue at BEP = BEP. x Price per Unit, Total Revenue at BEP = 400 x Rs.50, Total Revenue at BEP = To calculate the total cost at the breakeven point, we can use the following formula: Total Cost at BEP = Fixed Costs + Variable Costs per Unit x BEP Total Cost at BEP = Rs.10,000 + Rs.25 x 400 Total Cost at BEP = Rs.20,000 At the breakeven point, the business's total revenue (Rs.20,000) is equal to its total cost (Rs.20,000), resulting in neither profit nor loss. Example Cont... Margin of Safety In break-even analysis, margin of safety is the extent by which actual or projected sales exceed the break-even sales. It may be calculated simply as the difference between actual or projected sales and the break-even sales. formula to calculate margin of safety: MOS = Budgeted Sales -Breakeven Sales Breakeven Chart Limitations of Breakeven Analysis • It can only apply to a single product or a single mix of a group of products. • A breakeven chart may be time consuming to prepare. • It assumes fixed costs are constant at all levels of output. • It assumes that variable costs are the same per unit at all levels of output. • It assumes that sales prices are constant at all levels of output. • It assumes production and sales are the same (inventory levels are ignored). • It ignores the uncertainty in the estimates of fixed costs and variable cost per unit. Question 02 Vijitha Trading manufactures and sell dolls to the local market. Selling price per doll is Rs. 800. Variable cost per doll is Rs. 500. Total fixed cost for the period is Rs. 600,000. Budgeted sales units for the period is 4,500 dolls. Using the above information, Calculate: Contribution BEP in units III. BEP in sale value Margin of safety (in units and Rs.) Question 03 Present capacity / sales units = 5 000 Selling price per unit = Rs. 200 Contribution sales ratio = 40% Fixed cost = Rs. 240 000 Calculate, I. Contribution per unit II. Breakeven point in value and in units III. Margin of safety in units and rupees"
  },
  {
    "index": 7,
    "title": "7. Inventory Management",
    "content": "Inventory Management. MN 3043 - Business Economics & Financial Accounting G.V.N.Mahimi Kanchana Faculty of Engineering University of Moratuwa mahimin@uom.lk Learning Outcomes Introduction Purpose of Holding Inventory Inventory Systems Different Types of Inventory Costs Economic Order Quantity Inventory Valuation Methods Practice Questions Introduction ❑Inventory is the stock of any item or resource used in an organization. ❖Raw materials ❖Finished products ❖Work-in-process ❑An inventory system is the set of policies and controls that monitor levels inventory and determines what levels should be maintained, when stock should be replenished, and how large orders should be. Purpose of Holding Inventory To maintain independence of operations To meet variations in product demand To allow flexibility in production scheduling To provide a safeguard for variation in raw material delivery time To take advantage of economic purchase-order size and discounts To take advantage of currency fluctuations To manage the inventory cost Inventory System ❑Important control the processes purchasing, storing and issuing. ❑Questions in inventory system • What to order? • How many to order? • When to order? TIMING ISACRITICALISSUE!. Inventory Cost ✓Ordering costs (Co) - Costs incur to place the order. ✓Setup (or production change) costs - Costs for arranging specific equipment setups. ✓Holding (or carrying) costs (Ch) - Costs for storage, handling, insurance, etc. ✓Shortage costs - Costs of lost sales, emergency procurement, etc. Calculation of Different Stock Levels Objectives of calculating stock level To avoid holding unnecessary stocks, thus avoiding the loss of profits due to increased holdings costs. To avoid the risk of a stock out by storing enough material to facilitate the smooth flow of production. ✓Re- order level ✓Maximum stock level ✓Minimum stock level ✓Economic order quantity It is the level at which storekeeper will initiate purchase requisition. It is the point fixed between maximum stock level and minimum stock level. Re - order level = Maximum consumption during the period x Maximum period required for delivery Re-order level Minimum stock Average consumption per unit of time xAverage lead time) Re-order Level Maximum Stock level (MSL) This represents stock level above which stock level should not be allowed to rise. The main purpose of this level is to ensure that capital is not blocked up unnecessarily in stores. Maximum stock level = Re-order level + Re-order quantity (EOQ) (Minimum consumption during the period Minimum period required for delivery) Minimum stock level This is known as safety or buffer stock. Stock beyond this level should not be allowed to fall. Minimum stock level = Re- order level - (Average consumption during the period Average period required for delivery) Inventory Level - Chart Maximum level Lead time Re-order level Minimum level weeks units Practice Question 01 From the following information calculate, Re-order level Maximum stock level iii. Minimum stock level iv. Average stock level ⎯Re-order quantity 36,000 units ⎯Time required for delivery - 2 -4 months ⎯Maximum consumption per month 9,000 units ⎯Normal consumption per month 6,000 units Economic Order Quantity (EOQ) EOQ =√. 2xDxCo D - Annual demand Co - Cost of ordering per order Ch - Annual cost of holding per unit This represents most favorable quantity to be ordered each time fresh supplies are required. Assumptions for EOQ ❖Production or sales can be forecasted perfectly ❖Evenly distributed over the period ❖Lead time (time from ordering to receipt) is constant ❖Cost of materials remains constant ❖Cost of holding and ordering cost per unit remain constant during the year Practice Question 02 Monthly usage : 250 Cost of placing and receiving one order : Rs. 30 Carrying cost: Rs. 2 per unit Find out the EOQ Inventory Valuation ➢FIFO ➢WAC. Date Description 1st January 2020 Balance 200 units pillow @ 500 each 10th January 2020 Purchased 300 units @ 600 each 15th January 2020 Issued 250 units 20th January 2020 Purchased 100 units @ 650 each 24th January 2020 Issued 175 units Following transactions have been occurred during the month of January 2020. Prepare inventory ledger on following methods, 1. FIFO 2. WAC Practice Question 03 Date Description 1-Apr Balance 250 units pillow @ 50 each 12-Apr Purchased 300 units @ 60 each 16-Apr Issued 500 units 22-Apr Purchased 100 units @ 80 each 30-Apr Issued 100 units Following transactions have been occurred during the month of April. Prepare inventory ledger on following methods, 1. FIFO 2. WAC Practice Question 04"
  },
  {
    "index": 8,
    "title": "8. Introduction to Economics",
    "content": "The Foundation of Economics Ms. Mahimi Kanchana Faculty of Engineering University of Moratuwa Introduction to Economics. Basic Economic Problems & Factors of Production Economic Goods Vs. Free Goods Basic Economic Concepts (Scarcity, Choice Opportunity Cost etc.) Production Possibility Frontier Economic systems & Methodology Practice Questions Learning Outcomes What is Economics? Def. The study of how people satisfy their needs and wants. We tend to use money to purchase our needs and wants. Bartering (trading one thing for another) and making yourself are other methods. NEEDS:. are the basic necessities that a person must have in orderto survive e.g. : food,water, warmth, shelter and clothing WANTS:. are the desire that people have e.g. : things thatpeople would like tohave, such as bigger homes, iphones, etc. Human Needs &Wants Positive and Normative Economics ▪Health care can be improvedwith more taxfunding ▪Pollution control is effective througha system offines ▪Society ought to provide homesfor all ▪Any strategy aimed at reducingfactory closures in deprived areaswould be helpful Positive Statements: ➢Capable of being verified or refuted by resorting tofactor furtherinvestigation NormativeStatements: ➢Contains a value judgement cannot verified which resort investigation orresearch “Microeconomics focuses on explaining the behavior of individual firms, consumers, or product market....” In short, microeconomics looks at a small part of the economy. (Lipsey, 1997) “Macroeconomics looks at the output of the economy as a whole and is concerned with aggregate questions relating to inflation, unemployment, the balance of payment and business cycles.” (Lipsey, 1997) Microeconomics Vs.Macroeconomics Microeconomics Macroeconomics It studies the individual unit It studies the whole economy or large group Laws related to marginal analysis are included in its scope Problems related to whole economy like employment, public finance, national income etc. Microeconomics provides the information relating to the individual prices, individual consumption and production Macroeconomics provides the information relating to national income, total output, total consumption and general price level Microeconomic analysis is simple Macroeconomics complex due the study of large groups Microeconomics particularly focus price analysis Macroeconomics particularly focus on income analysis Microeconomics studies individual problems and it is less important for comparative study Macroeconomics studies the problems relating the economy and its importance is growing Microeconomics Vs.Macroeconomics Contd. The Economic Problem ✓Unlimited Wants ✓Scarce Resources - Land, Labour, Capital ✓Resource Use ✓Choices The Economic Problem The Economic Problem O What goods and services should an economy produce? - should the emphasis be on agriculture, manufacturing or services, should it be on sport and leisure or housing? O How should goods and services be produced? - labour intensive, land intensive, capital intensive? Efficiency? O Who should get the goods and services produced? - even distribution? more for the rich? for those who work hard? Basic Economic Concepts Scarcity The excess of wants resulting from having limited resources (land, labor, capital and entrepreneurs) in satisfying the endless wants of people. It is a universal problem for every society - It is not limited to poor nations. To the economist, all goods and services that have a price are relatively scarce. This means that they are scarce relative to people's demand for them. Choices ▪The problem of scarcity and choice lies at the very heart of economics, which is the study of how individuals and society choose toallocate scarce resources. ▪Since people do not have infinite income, they need to make choices whenever theyfulfiltheir infinitewants. ▪They have to decide how to allocate their limited financial resources between unlimitedalternatives. Economic Resources / Factors of Production ✓Land natural resources available forproduction renewable resources: those thatreplenish non-renewable resources: cannot bereplaced ✓Labor -physical and mental effort of people used in production ✓Capital -all non-natural (manufactured) resources that are used inthe creation and production of otherproducts ✓Enterprise (Entrepreneurship) -refers the management, organization and planning of the other three factors ofproduction Factors of Production Land Labor Capital Enterprise Rent Profit Interest Wages INCOME. Type of Payments to factors of Production Economic Goods Vs. Free Goods ✓Economic goods are those goods which use scarce resources in their production. For example, to produce simple good such as a paper clip, scarce resources are used including the material itself - usually steel wire, the machinery the shapes the clip, the machine operatives, the boxes to pack the clips in,and so on. ✓The use of scarce resources to produce one paper clip creates a cost to the producer, called the marginal cost. While this would be extremely small, the fact that the marginal cost is greater than zero means that scarce resources are being used, and the good is an economic good. contrast, free good one that does not require scarce resources for its production, and hence has a marginal cost of zero. The classic example of a free good air. Air exists as a 'gift of nature' and is afree good. Opportunity Costs All economic questions and problems arise from scarcity. Economics assumes people do not have the resources to satisfy all of their wants. Therefore, we must make choices about how to allocate those resources. ex: We make decisions about how to spend our money and use our time. Opportunity Costs Cont. The cost of the next best use of your time or money when you choose to do one thing rather than another is opportunity cost. Let's say you have five dollars. What would you like to spend it on? There are a million things you would love to spend five bucks on, but let's imagine there are only three things out there you really want to buy: gum, soda, and movie tickets. Look at the price chart below and answer the questions. Look at the price chart below and answer the questions Good Price Gum Soda Movie Ticket How many sodas can youbuy instead of one movie ticket? How many pieces of gum can you buy instead of one soda? What is the Opportunity Cost of Going to College? Benefits ◦Higher Income ◦More Job opportunities ◦Job opportunities in a career I enjoy ◦Job opportunities in more places Opportunity Costs ◦Costs a LOT of money ◦Student loans for years ◦4 (or more) years of school ◦No guarantee of a job when I get out ◦What if I change my mind? Trade Offs Decisions involve tradeoffs. When you make a choice, you give up an opportunity to do something else. The highest-valued alternative you give up is the opportunity cost of your decision. Trade off: Sleep vs. Study Options Benefit Opportunity Cost 1 hour of extra study time Grade of C on test 1 hour of sleep 2nd hour extra study time Grade of B on test 2 hours of sleep 3rd hour of extra study time Grade of B+ on test 3 hours of sleep Trade Offs Def. When you choose between two possible uses for a resource, giving up one alternative for another. Bridge vs. Building I can either buy this book or pizza, but not both. Trade Offs Ex : - You won a radio station contest, and you are now $300 dollars richer. You can finally start looking for a new system in your car. Determine what criteria you think are important for choosing a system and identify the tradeoffs made when selecting one stereo over another. ➢You will encounter similar decisions for the rest of your life - what college to attend, what house to purchase, what kind of car to purchase, when to have children, how many children do you want to have, what school to send your children to, etc. ➢Researching opportunity cost of all options in any decision-making process is vital in order to make the best available choice. ➢Also keep this in mind, Americans spend 85% of their financial resources on things that will not last for more than three years. Identical twins Ashley and Mary Kate graduate with Bachelors degrees and receive the same job offer. Ashley passes up the job offer to pursue a Masters degree while Mary Kate takes the job offer and begins working. Two years pass and Ashley graduates and begins working. By this time Mary Kate has been promoted to a position that is comparable to Ashley's starting position, and Mary Kate's salary has increased to an amount that is comparable to Ashley's starting salary. So who made the better decision, Ashley or Mary Kate? In business and in life, every choice we make comes at a cost since we forgo other possible alternatives in the process; this cost - whetherit's money, time, education, health, et cetera - is known as an opportunity cost. In the example, one could argue that Ashley made the better decision since a Masters degree would be valuable if both lost their jobs and found themselves competitive job the market. Yet when you look at situation in terms of opportunity costs, Ashley's Masters degree came at a cost of two years salary. If Ashley and Mary Kate stay on equal career paths from here on out, Mary Kate ends up making the better decision. An opportunity cost is the value or benefit of the next best alternative. Opportunity costs even come into play in the pursuit of happiness ✓Opportunity costs are all around us and they differ from individual to individual. Take one look at Steve Jobs and Bill Gates and think of the opportunity costs if they had decided to forgo their entrepreneurial pursuits and continue their college education instead. ✓Things would be very different now. ✓Ultimately, opportunity costs apply to anything which is of value to a person and being conscious of how they apply to your situation can help in making a satisfactory choice/decision by considering the value or benefit of the next best alternative. Types of Goods Available in an Economy Consumer Goods Consumer goods are products that are directly purchased and consumed by individuals and households to satisfy their needs and wants. Characteristics: • These goods are typically used for personal consumption and enjoyment. • Consumer goods can be further classified into durable goods (e.g., appliances, cars) and non-durable goods (e.g., food, clothing). • Demand for consumer goods is influenced by consumer preferences, income levels, and economic conditions. Ex: Clothing, electronics, food products, automobiles, furniture, and entertainment items like books and movies. Capital Goods Capital goods, also known as producer goods or intermediate goods, are items used by businesses and industries to produce other goods and services. They are not for immediate consumption but are essential for the production process. Characteristics: • These goods are used to create wealth by producing other goods and services. • Capital goods can include machinery, equipment, factories, infrastructure, and technology. • Their value lies in their contribution to increasing the efficiency and productivity of a business or industry. Ex: Manufacturing equipment, construction machinery, transportation vehicles, computers, and commercial real estate. Services Services are intangible products or actions provided by individuals or businesses to meet specific needs, desires, or tasks of consumers. They do not result in a physical product. Characteristics: • Services are often labor-intensive and involve human skills and expertise. • They encompass a wide range of activities, from healthcare and education professional services like legal counsel and consulting. • Services are consumed at the time of production and do not typically leave a tangible product behind. Ex: Healthcare services, education, legal advice, hairdressing, transportation services taxi rides), financial consulting, and entertainment (e.g., movies, concerts). Production Possibility Frontiers Production Possibility Frontiers ✓Show the different combinations of goods and services that can be produced with a given amount of resources ✓No 'ideal' point on the curve ✓Any point inside the curve - suggests resources are not being utilised efficiently ✓Any point outside the curve - not attainable with the current level of resources ✓Useful to demonstrate economic growth and opportunity cost Production Possibility Frontiers Capital Goods Consumer Goods Assume a country can produce two types of goods with its resources - capital goods and consumer goods If it devotes all resources to capital goods it could produce a maximum of If it devotes all its resources to consumer goods it could produce a maximum of Xm If the country is at point A on the PPF It can produce the combination of Yo capital goods and Xo consumer goods If it reallocates its resources (moving round the PPF from A to B) it can produce more consumer goods but only at the expense of fewer capital goods. The opportunity cost of producing an extra Xo - X1 consumer goods is Yo - Y1 capital goods. Consumer Goods Production inside the PPF - e.g. point B means the country is not using all its resources It can only produce at points outside the PPF if it finds a way of expanding its resources or improves the productivity of those resources it already has. This will push the PPF further outwards. Production Possibility Frontiers Capital Goods 1. Constant opportunity cost (A straight line) 2. Increasing opportunity cost (Concave) 3. Decreasing opportunity cost (Convex) Main Shapes of a Production Possibility Frontiers 1. Expansionofresources.(increaseintheavailabilityof resources) 2. TechnologicalImprovements.(technologicalimprovement increases theproductivityof resources) 3. MoreEducationorTraining Shift in the Production Possibility Frontiers Economic systems & Methodology Traditional Economy A traditional economy is an economic system in which economic decisions, production, and distribution of goods and services are primarily based on customs, traditions, and historical practices. traditional economies, economic activities are often shaped by long-standing cultural and social norms, and there is limited reliance on modern technology or external trade. Traditional Economy &Economic Decisions 1.What goods to produce: In a traditional economy, goods to produce are determined by customs, traditions, and historical practices. Production is guided by the needs of the community, and goods typically have cultural or subsistence significance. 2.How to use resources in the production process: Resource allocation is based on customary practices and community needs. Resources are typically used in ways that have been passed down through generations, emphasizing self-sufficiency and sustainability. 3.Who receives the finished goods: Finished goods are primarily distributed within the community or among community members. Distribution is often based on communal norms and social ties, with an emphasis on meeting basic needs rather than profit or market exchange. Command Economy A command economy, also known as a planned economy or centrally planned economy, is an economic system in which the government or a central authority has significant control over the production, allocation, and distribution of goods and services within an entire economy. In a command economy, most economic decisions are made by the government, and individual consumers and producers have limited influence over these decisions. Command Economy Key characteristics of a command economy include: 1.Central Planning: The government or a central planning authority creates detailed plans and directives outlining what and how much should be produced, the methods of production, and how resources should be allocated. These plans often cover various sectors of the economy, such as agriculture, industry, and services. 2.Ownership: In many command economies, the government or state owns and controls major industries, enterprises, and resources. Private ownership and entrepreneurship may be limited or heavily regulated. 3.Resource Allocation: Central authorities determine the allocation of resources, including labor, capital, and natural resources, based on the priorities set in the central plan. This can lead to a focus on specific industries or sectors deemed essential for the country's development. 4.Price Controls: Prices for goods and services are often set or controlled by the government to maintain stability and prevent inflation. These prices may not necessarily reflect market demand and supply dynamics. 5.Limited Consumer Choice: In command economies, there may be limited consumer choice in terms of available products and services. Consumers may have access to a narrower range of options compared to market-driven economies. 6.Minimal Competition: Competition is often limited or nonexistent in command economies since the state typically controls major industries. This can lead to reduced innovation and efficiency. Command Economy & Economic Decisions 1. What goods to produce: Determined by the central planning authority based on national priorities and objectives. 2. How to use resources in the production process: Allocation of resources is centrally planned, optimizing resource use for state-defined goals. 3. Who receives the finished goods: Distribution is controlled by the central authority, often involving state-run mechanisms and rationing. Disadvantages of Command Economy 1.Lack of Efficiency: Centralized planning can result in inefficiencies in resource allocation, production, and distribution. The absence of market forces and competition may lead to overproduction or underproduction of goods and services. 2.Bureaucratic Inefficiency: Central planning often involves extensive bureaucracy, which can lead to red tape, slow decision-making, and misallocation of resources. Bureaucrats may not always have the expertise to make optimal economic decisions. 3.Lack of Innovation: Command economies may stifle innovation and technological progress because they often discourage entrepreneurship and individual initiative. There may be less incentive for businesses to innovate when there is no competition. 4.Shortages and Surpluses: Central planning can result in shortages of certain goods and surpluses of others. These imbalances can lead to consumer dissatisfaction and waste of resources. 5.Consumer Choice and Variety: Command economies may offer limited consumer choice, as goods and services are typically standardized and produced according to the central plan. This can lead to a lack of diversity in products and services. Disadvantages of Command Economy 6. Lack of Individual Freedom: Command economies often restrict individual economic freedom and decision-making. Choices about where to work, what to produce, and how to spend one's income may be limited. 7. Incentive Problems: When wages are fixed or centrally determined, there may be little incentive for workers to improve their productivity, leading to inefficiencies. 8. Resource Misallocation: Central planners may prioritize certain industries or sectors based on political or ideological considerations rather than economic efficiency. This can lead to misallocation of resources. 9. Information Gaps: Command economies may struggle with information gaps and inadequate data on supply and demand, making it difficult to plan accurately. 10. Resistance to Change: Command economies are often resistant to change and adapt slowly to evolving economic conditions or technological advancements. 11. Lack of Consumer Sovereignty: Consumer preferences may not be adequately considered in the planning process, leading to mismatches between supply and demand. 12. Potential for Corruption: Centralized planning can create opportunities for corruption and rent-seeking among government officials and bureaucrats. Market Economy A market economy, also known as a free-market economy or capitalism, is an economic system in which most economic decisions and resource allocation are determined by supply and demand in a competitive market. In a market economy, the production, distribution, and pricing of goods and services are primarily driven by private individuals and businesses, rather than by government central planning. Key characteristics of a market economy include: 1.Private Ownership: Individuals and businesses have the right to own, control, and dispose of property, including land, capital, and businesses. Private property rights are a fundamental feature of a market economy. 2.Market Forces: Prices, production quantities, and resource allocation are determined by market forces of supply and demand. Prices serve as signals that guide economic decisions. 3.Competition: Markets are characterized by competition among businesses and individuals. Competition encourages efficiency, innovation, and the pursuit of profit. 4.Limited Government Intervention: In a pure market economy, government intervention in economic affairs is limited. The government typically plays a role in enforcing property rights, contracts, and regulations that promote fair competition. Market Economy &Economic Decisions 1.What goods to produce: Driven by consumer demand and profit incentives; producers prioritize goods with high demand and profit potential. 2.How to use resources in the production process: Resource allocation based on market forces; resources flow to industries with high returns. 3.Who receives the finished goods: Distributed through voluntary exchange in the market; received by those who can afford and choose to purchase them. Disadvantages of Market Economy 1.Income Inequality: Market economies can lead to significant income inequality, with a concentration of wealth and income among a small percentage of the population. This can result in disparities in living standards and access to opportunities. 2.Lack of Basic Services: In pursuit of profit, some essential services and goods may be undersupplied in certain areas or to certain groups of people. For example, remote or low-income areas may have limited access to healthcare, education, or infrastructure. 3.Boom-Bust Cycles: Market economies can be prone to economic cycles, including recessions and financial crises. Periods of economic downturn can lead to job losses, financial instability, and social hardship. 4.Market Failures: Markets may not always allocate resources efficiently or address certain societal needs. Market failures can occur when externalities, public goods, or information asymmetry lead to suboptimal outcomes. Disadvantages of Market Economy Cont. 5. Monopoly and Oligopoly Power: In unregulated markets, businesses may gain excessive market power, leading to monopolies or oligopolies that can stifle competition, limit consumer choice, and drive up prices. 6. Short-Term Focus: Businesses in market economies may prioritize short-term profit maximization over long-term sustainability or societal well-being. This can lead to environmental degradation and disregard for social responsibilities. 7. Environmental Concerns: Market economies can sometimes neglect environmental concerns and sustainability as firms may prioritize profit and growth over ecological conservation. 8. Insecurity: The absence of strong safety nets can leave individuals vulnerable to economic shocks, job loss, or unforeseen circumstances. The fear of instability can create stress and anxiety in society. 9. Overemphasis on Materialism: Market-driven societies often emphasize material success and consumption, which can lead to shallow values and neglect of non-material aspects of well-being. Mixed Economy A mixed economy is an economic system that combines elements of both market economies and planned or command economies. In a mixed economy, there is a blend of private ownership and government intervention, with both the market forces of supply and demand and government policies playing significant roles in shaping economic activity. Key characteristics of a mixed economy include: 1.Private Ownership: Individuals and businesses have the right to own, control, and operate private property, including businesses, land, and capital. Private enterprise is a fundamental feature of a mixed economy. 2.Market Forces: Prices, production quantities, and resource allocation are influenced by market forces of supply and demand. Producers and consumers interact in competitive markets to determine prices and production decisions. 3.Government Regulation: The government plays a role in regulating and overseeing economic activities to ensure fair competition, protect consumers, and address market failures. Regulations can cover areas such as safety standards, environmental protection, and consumer rights. 4.Public Goods and Services: Governments provide and finance public goods and services that are essential but may not be efficiently provided by the private sector. Examples include infrastructure, education, healthcare, and national defense. Mixed Economy &Economic Decisions 1.What goods to produce: Influenced by market demand and consumer preferences, with some government guidance and regulation. 2.How to use resources in the production process: Combination of market-driven allocation for efficiency and government intervention for addressing societal goals and market failures. 3.Who receives the finished goods: Distributed through voluntary market transactions based on consumer choices and purchasing power, with government safety nets to address social needs."
  },
  {
    "index": 9,
    "title": "Demand and Supply",
    "content": "Demand Theory, Supply Theory and Market Equilibrium Learning Outcomes Consumer markets Various types of products Demand, Demand theory & Law of demand Supply, Supply theory & Law of supply Market Equilibrium Market A set of arrangements by which buyers and sellers are in contact to exchange goods and services. Various types of markets ❑Physical (Buyers , sellers and goods and services in physical presence or contact) ❑Intermediate (share market) ❑Super (prices are fixed) ❑Electronic (www.) and Tele (Video/phone/fax) Auction (ascending, descending, sealed bid), ❑Differentiated (customer, product, quality...) Homogenious (same type of goods and same price) ❑Geographical (regional, city, rural, estate) etc. Various types of products Normal products (If the quantity demanded rises as incomes rise and falls when incomes fall) Inferior products (If the quantity demanded fall as incomes rise and rises when incomes fall) Giffen products (A special case of the inferior product arises when as price rises, more of the good in question is bought resulting upward slopping demand curve) Veblen products (A special case of Giffen luxury product: prices goes down people will buy more prices goes up people will buy more - Jewellery market -conspicuous consumption). Independent/dependent products (goods which can/not consume independently) Substitution Product (instead of one good we can use other good). Complementary Products (without the help of other goods we can not use them). Demand The demand for a product or service is how much of a product or service people are willing and able to purchase at various prices. Demand is represented graphically as a downward sloping curve with price on the vertical axis and quantity on the horizontal axis The Determinants of demand Shifts in the curve (change in demand) result from changes in one or more of the non-price determinants of demand: • Number of Consumers in the market (Size of Market) • Consumer Tastes and Preferences • Consumer Income • Prices of Related Goods (Substitute Complimentary Goods) • Expectations about the Future Goods and Law of Demand • All other factors equal, the higher the price of the good or service, the lower the quantity demanded (price induced change). And the lower the price, the higher the quantity demanded. Price and Quantity Demanded vary inversely • Change in Quantity Demanded - A change in the quantity consumers are willing and able to purchase. It is a response to a change in the market price. Law of Demand Why are price and quantity demanded negatively related? Substitution effect When the price of a good rises, consumers are more willing to substitute other relatively less expensive goods for this good - quantity demanded falls Law of Demand Why are price and quantity demanded negatively related? Income effect When the price of a good rises, a consumer's purchasing power or real income falls, causing them to decrease consumption Income = $100 P(coffee) = $4; real income = 25 coffees If P(coffee) = $5; real income = Demand Curve Demand Curve - A downward sloping curve that measures the relationship between the price of a good and the quantity demanded by consumers. Demand - The amount that consumers are willing and able to purchase at various prices. Change in Demand - A shift in the position of the demand curve that occurs in response to a change in one or more of the determinants of demand (non-price induced change) Demand Function Demand Curve Generally, the relationship between price and quantity is negative. This means that the higher the price level the lower will be the quantity demanded and, the lower the price the higher will be the quantity demanded. The Demand Curve: Increases In Demand • Curve shifts to the right as a result of an increase in demand by the consumers (D1 to D2). This is caused by a change in one or more of the determinants of demand. • This causes Price to increase (P1 to P2). This shows a willingness to pay a higher price for all possible quantities of the good. • Suppliers respond to the higher price by increasing Quantity Supplied (q1 to q2). • This process results in a new Equilibrium at e2 with Equilibrium Price P2 and Equilibrium Quantity q2. The Demand Curve: Decreases In Demand • Demand curve shifts to the left as a result of a decrease in demand by the consumers (D1 to D2). This is caused by a change in one or more of the determinants of demand. • This causes Price to decrease (P1 to P2). This shows a decreased willingness to pay for all possible quantities of the good. • Suppliers respond to the lower price by decreasing Quantity Supplied (q1 to q2). • This results in a new Equilibrium at e2 with Equilibrium Price P2 and Equilibrium Quantity q2. Demand schedule Price (dollars per player) Quantity (millions of players per month) As the price falls, the quantity of players demanded increases Quantity (millions of players per month) Demand Price (dollars per player) Demand schedule and demand curve Demand schedule Price (dollars per player) Quantity (millions of players per month) Demand As the price falls, the quantity of players demanded increases Quantity (millions of players per month) Price (dollars per player) Demand schedule and demand curve Factors that Shift the Demand Curve • Change in consumer real income Because a consumer's demand for goods and services is limited by income, higher income levels allow the consumer to purchase more products, when this happens the demand curve shifts to the right. When the opposite occurs, a decrease in real income, this shifts the demand curve to the left. When the economy enters a recession and more people become unemployed and so incomes fall, the demand for many goods and services shifts to the left. Factors that Shift the Demand Curve Population change An increase in population shifts the demand curve to the right Consumer preferences If a good becomes fashionable the demand curve for that good shifts to the right Prices of related goods If prices of related goods change, the demand curve for the original good can change as well. Related goods can either be substitutes or complements. Factors that Shift the Demand Curve Complements are goods that are normally consumed together. If the price of a complement increases, the demand curve for the original good shifts to the left. If the price of a complement decreases, the demand curve for the original good shifts to the right. If, for example, the price of cars falls, then the demand curve for petrol shifts to the right. What is substitute and complementary goods? Substitutes are goods that can be consumed in place of one another. If the price of a substitute increases, the demand curve for the original good shifts to the right. People buy less of the substitute, and more f the alternative. A movement along a Demand Curve It is essential to distinguish between a movement along a demand curve and a shift in the demand curve. A change in price results in a movement along a fixed demand curve. This is also referred to as a change in quantity demanded. For example, an increase in coffee prices from £2 to £4 may reduce the quantity demanded from 40 units to 20 units. This price change results in a movement along a given demand curve. A change in any other variable that influences quantity demanded (for example an increase in incomes) produces a shift in the demand curve. A shift in the demand curve changes the equilibrium position. So, this increase in incomes has increased demand for coffee from 20 to 40 at a price of £4. Supply The market or total supply is the quantity producers are willing to supply to the market (sell) over a range of prices for any given time period. The total supply is the sum of the individual amounts of product that each individual producer supplies to the market Law of Supply Holding everything else constant, when the price of a product increases the quantity supplied will increase, and when the price of a product decreases, the quantity supplied will decrease. Price & Quantity supplied are positively related. Supply Function Supply Curve An increase in price in will result in producers wanting to increase the quantity of a product they will sell on the market (chasing profits). Therefore, the relationship between the price and supply is positive - the higher the price the higher the quantity supplied As the price falls, the quantity of players supplied decreases Quantity (millions of players per month) Price (dollars per player) Supply schedule Price (dollars per player) Quantity (millions of players per month) Supply schedule and supply curve Supply Quantity (millions of players per month) Price (dollars per player) Supply schedule Price (dollars per player) Quantity (millions of players per month) As the price falls, the quantity of players supplied decreases Supply Supply schedule and supply curve Factors that Shift the Supply Curve • Change in input costs An increase in input costs shifts the supply curve to the left. If input costs decline, output increases, and the supply curve shifts to the right. • Change in size of the industry If new firms enter an industry, the supply curve shifts to the right. The diagram shows a shift to the left of the supply curve, (S1 to S2). This could have been caused by an increase in costs of supplying companies Factors that Shift the Supply Curve • Improvements in technology An improvement in technology shifts the supply curve to the right. Technological progress allows firms to produce a given item at a lower cost. With the advancement of technology, the supply curve for goods and services shifts to the right. A movement along a Supply Curve • As with demand curves, it is essential to distinguish between a movement along a given supply curve and a shift in a supply curve. • A change in price results in a movement along a fixed supply curve. This is also referred to as a change in quantity supplied. For example, if the selling price of coffee rises from £3 to £4, quantity supplied increases from 30 to 40 units • A change in any other variable that influences quantity supplied (e.g. costs of production) produces a shift in the supply curve. This shift to the left could be caused by increased rent for coffee shops. Increased rental charges, shifts the supply curve to the left - less coffee shops, less coffee supplied Market equilibrium If we plot both demand and supply. curves, where they intersect, we have the market equilibrium. This equilibrium gives us the market price (P)and the quantity sold (Q) In simple terms, Equilibrium price is the price at which quantity demanded equals quantity supplied. Market equilibrium What happens if price is above equilibrium? • Quantity supplied > quantity demanded • There will be a surplus • Price will automatically fall to clear the surplus Supply Demand Surplus of 10 million players resulting from price above equilibrium. Price (dollars per player) Quantity (millions of players per month) The effect of surpluses and shortages on the market Market equilibrium What happens if price is below equilibrium? • quantity demanded > quantity supplied • There will be a shortage • Price will automatically rise to clear the shortage Supply Demand Shortage of 20 million players resulting from price below equilibrium. Price (dollars per player) Quantity (millions of players per month) The effect of surpluses and shortages on the market Changes in Equilibrium There are 4 types of changes 1. Increase in Demand 2. Decrease in Demand 3. Increase in Supply 4. Decrease in Supply Changes in Equilibrium What could cause market price to increase? Increase in Demand; or Decrease in Supply An increase in demand Price Quantity Supply Initial equilibrium 3 ... and a higher quantity sold. 2 ... resulting in a higher price ... 1. An increase in population New equilibrium A decrease in supply Demand New equilibrium Initial equilibrium 2... resulting in a higher price 1. An increase in the cost of production 3... and a lower quantity sold. Price Quantity Markets are interrelated In UK market Sri Lankan imported tea is very popular among consumers. A cyclone that devastated tea plantations in Sri Lanka caused tea prices to increase in UK markets which then caused coffee prices to rise. Explain Tea Market Which curve will shift? If coffee is a substitute for tea, what will happen to coffee prices? •Which curve will shift? Coffee Market More Complex - change in BOTH Demand & Supply What happens if both demand and supply shift at the same time? What if there is an increase in Demand and an increase in Supply What will happen to P & Q ? Price remain constant & Quantity increase New equilibrium is e2 Increase in both demand and supply Quantity MUST increase But price could rise, fall or stay the same Simultaneous Shifts in Supply and Demand What would happen to price & quantity, if there was an increase in demand and a decrease in supply? Price must increase Quantity is indeterminate - Q could rise, fall or stay the same Review Questions Question 01 If the demand and supply curve for sports shoes is: Where P is the price of sports shoes, what is the quantity of sports shoes bought and sold at equilibrium? (Prices are in “000”) Review Questions Question 02 Meat supplies are sharply reduced because of a disease spread among hens and chicks. In the meat-raising states, and consumers turn to fish as a substitute for meat. How would you illustrate this change in the meat market in supply-and-demand terms? Question 03 In January, the price of textbooks rise, and the number of textbooks sold also rises. Is this a violation of the law of demand? Comment Review Questions Question 04 Consider the following information, Given the above demand and supply equations for milk packets, find the equilibrium price and quantity. Review Questions Question 05 The following table gives the daily supply and demand for hot dogs at a sporting event. Price Quantity demanded Quantity supplied What is the equilibrium price of hot dogs? What makes you think so? II. If the organizers of the sporting event decide to set the price at 180, how many hot dogs will be sold? Review Questions Question 06 The total demand for ice cream tub and the total supply of ice cream tub during the month of April are as follows: Calculate the equilibrium price and the quantity for ice cream tub II. Calculate the market surplus or shortage at each price point for ice cream tub Price Quantity demanded Quantity supplied Review Questions Question 07 Crude oil supplies are sharply reduced because of covid-19 pandemic and the recession of the country. In the raising pricing states of crude oil, and consumers turn to solar power as a substitute for crude oil. How would you illustrate this change in the crude oil market in supply- and-demand terms? Review Questions Question 08 Suppose that the market demand for new action game “Underworld Heroes” is given by Q = 1500 - 250P and the market supply of new action game “Underworld Heroes” is given by Q = 500+150P, where P is the price per one subscription of game and Q is the number of players purchase per month. (Prices are in $ value) What are the equilibrium price and quantity for new action game “Underworld Heroes”? Illustrate your answer graphically Explain why the market will be in disequilibrium at a price of $1.50 per new game player Explain how the market will adjust from a price of $1.50 per new game player to the equilibrium identified in part (a)."
  }
]